InformationRegisters/СведенияОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбИмуществе</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСведений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваИмущества</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваИмущества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Имущество</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/СвойстваИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>СвойстваИмущества</Name>
			<Comment>Типы предопределенных элементов заданы программно</Comment>
			<Type>
				<v8:Type>cfg:EnumRef.НазначениеЗемельныхУчастков</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.тсЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>6</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИмущества</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.Имущество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/СведенияОбИмуществе/Ext/ManagerModule.bsl
Функция РеквизитыНаименования(Имущество, ДопустимыеТипы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваИмущества.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втСведенияДляНаименования
		|ИЗ
		|	ПланВидовХарактеристик.СвойстваИмущества КАК СвойстваИмущества
		|ГДЕ
		|	СвойстваИмущества.ВключатьВНаименование = ИСТИНА
		|	И СвойстваИмущества.ПометкаУдаления = ЛОЖЬ
		|	И СвойстваИмущества.ТипИмущества В(&ТипыИмущества)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбИмуществеСрезПоследних.Свойство КАК Свойство,
		|	СведенияОбИмуществеСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СведенияОбИмуществе.СрезПоследних(
		|			,
		|			Имущество = &Имущество
		|				И Свойство В
		|					(ВЫБРАТЬ
		|						втСведенияДляНаименования.Ссылка КАК Ссылка
		|					ИЗ
		|						втСведенияДляНаименования КАК втСведенияДляНаименования)) КАК СведенияОбИмуществеСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Свойство";
	
	Запрос.УстановитьПараметр("Имущество", Имущество);
	Запрос.УстановитьПараметр("ТипыИмущества", ДопустимыеТипы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение");

КонецФункции // ()
